/***************************************************************************************
Copyright (C), 2011,  Co.Hengjun, Ltd.
文件名:  search_route.h
作者:    CY
版本 :   1.0	
创建日期:2011/12/2
用途:    进路搜索
历史修改记录:         
***************************************************************************************/
#ifndef SEARCH_ROUTE
#define SEARCH_ROUTE

/****************************************************
函数名:    search_route
功能描述:  进路搜索
返回值:    
作者  :    CY
日期  ：   2011/12/2
****************************************************/
void search_route(void);

#endif
