/***************************************************************************************
Copyright (C), 2011,  Co.Hengjun, Ltd.
文件名:  semi_auto_block.h
作者:    CY
版本 :   1.0	
创建日期:2012/3/28
用途:    半自动闭塞数据结构
历史修改记录:         
***************************************************************************************/

#ifndef SEMI_AUTO_BLOCK
#define SEMI_AUTO_BLOCK

/****************************************************
函数名:    semi_auto_block_failure
功能描述:  按压半自动故障按钮后的处理过程
返回值:    
参数:      int16_t button_index
作者  :    CY
日期  ：   2012/3/28
****************************************************/
void semi_auto_block_failure(int16_t button_index);

/****************************************************
函数名:    semi_auto_block_recovery
功能描述:  按压半自动复原按钮后的处理过程
返回值:    
参数:      int16_t button_index
作者  :    CY
日期  ：   2012/3/28
****************************************************/
void semi_auto_block_recovery(int16_t button_index);

/****************************************************
函数名:    semi_auto_block_block
功能描述:  按压半自动闭塞按钮后的处理过程
返回值:    
参数:      int16_t button_index
作者  :    CY
日期  ：   2012/3/28
****************************************************/
void semi_auto_block_block(int16_t button_index);

/****************************************************
函数名:    semi_auto_block_process
功能描述:  半自动状态管理过程
返回值:    
作者  :    CY
日期  ：   2012/3/28
****************************************************/
void semi_auto_block_process();

/****************************************************
函数名:    sab_recieving_route_unlock
功能描述:  判断接车进路是否已解锁
返回值:    
参数:      int16_t index
作者  :    CY
日期  ：   2012/3/28
****************************************************/
void sab_recieving_route_unlock(int16_t index);

/****************************************************
 函数名:    gsab_state
 功能描述:  获取半自动闭塞状态
 返回值:    
 参数:      int16_t index
 作者  :    CY
 日期  ：   2012/3/28
 ****************************************************/
 EN_semi_auto_block_state gsab_state(int16_t index);

 /****************************************************
 函数名:    set_semi_relate_route
 功能描述:  设置半自动关联的进路
 返回值:    
 参数:      int16_t semi_auto_index
 参数:      int16_t route_index
 作者  :    CY
 日期  ：   2012/7/31
 ****************************************************/
 void set_semi_relate_route(int16_t semi_auto_index, int16_t route_index);

#endif
